{
	"009": "AP English Literature and Composition is a seminar-type course in which students will read closely and critically analyze works from several genres and periods – from the 16th to the 20th century. They will deepen their understanding of the ways writers use language to provide both meaning and pleasure. Students will consider a work’s structure, style, and themes, as well as elements such as the use of figurative language, symbolism, and tone. Writing is an integral part of this course. Writing assignments will focus on the critical analysis of literature, and will include expository, analytical, and argumentative essays. In preparation for the College Board examination, students will receive practice in writing timed essays and in tackling multiple-choice questions. Prerequisite: Honors British Literature and Honors American Literature or Teacher recommendation.",
	"012": "This course focuses on the 6+1 traits of effective writing - word choice, organization, voice, sentence fluency, ideas, conventions, and presentation. Students build their skills and develop confidence by practicing many different kinds of writing including biographical narratives, editorials, process essays, business letters, poetry, fairy tales, book reports, time lines, and SAT essays. This course challenges students to develop their own personal literary style as they read, analyze and respond to both fiction and non–fiction text. Prerequisite: Grade 9 Language Arts; G10 or above",
	"013": "The journalism course provides students with an opportunity to improve their writing skills and have their work read by the audience of the ICS school newspaper. Students will learn to write feature stories, editorials, personal profiles and columns, and will create editorial cartoons and photo stories. Journalism ethics and a career in journalism will be explored. Students will discuss and write about current news events. The final assessment in this course will be a portfolio containing a selection of the student’s best work along with their reflections on the process of creating it. Prerequisite: None, however students in G9 must take Grade 9 Language Arts concurrently, and students in G10 must take Literature Survey or Composition concurrently. Students in grades 9 – 12 may take Journalism ONCE for English credit.",
	"017": "In this class, students will learn effective persuasive writing and speaking, especially the use of figures of speech and other compositional techniques. By completing this course students will understand the differences between spoken and written language, hone purpose-related research and writing skills, including brainstorming, outlining and drafting. Students will have four to five compositions to write and present over the course of the semester, including narrative, informative, and persuasive speeches with a call to action. As students share their writing through oral presentations, they will develop skills in listening, interpersonal and group communication, and public performance, as they grow in self-confidence in public settings. Prerequisite: None; however students in G9 must take Grade 9 Language Arts concurrently and students in G10 must take Literature Survey or Composition concurrently.",
	"019": "Poets and Poetry is a class that will study the masters of poetic form and their craft with the intention of creating an appreciation for poetic form. This class also has a dual focus of learning how to use various forms and poetic devices in order to create original compositions that shed light and new perspectives on the world around us. Students will study poetry, and become poets. Prerequisite: None, but students in G9 must take Grade 9 Language Arts concurrently, and students in G10 must take Literature Survey or Composition concurrently.",
	"020": "AP English Language and Composition is a course where students will read and critically analyze excellent writing. It focuses on the development and revision of evidence-based analytic and argumentative writing and the rhetorical analysis of non-fiction texts. They will deepen their understanding of the ways writers use language to communicate well. Writing assignments will include expository, analytical, and argumentative essays. Students evaluate, synthesize and cite research to support their arguments. In preparation for the College Board examination, students will receive practice in writing timed essays and in tackling multiple-choice questions. Students should be able to read and comprehend college-level texts and apply the conventions of standard written English in their writing. Prerequisite: G10 with a 95% grade in Grade 9 Language Arts. G11 or above with A grades in Literature Survey, Composition, Novel and Creative Writing, or College Writing.",
	"030": "AP Seminar is a foundational course that engages students in cross-curricular conversations that explore the complexities of academic and real-world topics and issues by analyzing divergent perspectives. Students will use an inquiring framework to practice reading and analyzing articles, research studies, and foundational literary and philosophical text. They will also listen to and view speeches, broadcasts, and personal accounts, and experience artistic works and performances. Students will learn to synthesize information from multiple sources, develop their own perspectives in research-based written essays, and design and deliver oral and visual presentations, both individually and as part of a team. Ultimately, the course aims to equip students with the power to analyze and evaluate information with accuracy and precision in order to craft and communicate evidence-based arguments. Prerequisite: G11 or above with an A grade in Composition, Literature Survey, or Asian Studies; or with teacher recommendation.",
	"033": "Grade 9 Language Arts is an introductory course. The first semester covers a variety of literature, emphasizing active reading, critical reflection and literary analysis, and written response. The second semester focuses on mythology, a Shakespearean play, and another more extensive literary work. Concurrently, students will also develop their writing skills – both creative and analytical. They will be taught writing fundamentals including the Six Traits of Effective Writing, the writing process, research, and creative writing. It is intended that critically studying literature will inform, inspire, and develop writing and composition. Note: This is a required course for all G9 students.",
	"050": "This intensive semester course comprises an in-depth survey and analysis of American literature from the colonial period to the beginnings of the modern age. Students will be working on developing advanced levels of critical thinking and expository writing. Prerequisites: Literature Survey (recommended) or Composition; G11 or above. Note: This course is required for students wishing to take AP English Literature. It is strongly recommended that students who intend to study AP US History also take Honors American Literature.\n",
	"051": "This intensive semester course comprises an in-depth survey and analysis of British Literature from the Anglo-Saxon period to the beginnings of 20th century writing. Students will be working on developing advanced levels of critical thinking and expository writing. Prerequisites: Literature Survey (recommended) or Composition; G11 or above. Note: This course is required for students wishing to take AP English Literature. It is strongly recommended that students who intend to study AP World History also take Honors British Literature.",
	"052": "This course focuses on preparing students for university level writing. Students will learn the skills needed to be successful in an academic setting such as seminar presentation, SAT vocabulary mastery, developing a resume and defending opinions. They will write research papers, college essays, SAT essays, reviews, and articles. They will also explore writing genres that can enrich their personal lives such as family stories, poetry, travel blogs, advertisements, personal creeds, short stories, and dialogues. Students will gain the skills to be coherent communicators, and enhance their opportunity for success in whatever career they choose. College-level critical thinking and writing skills are expected of students by the end of the year. Prerequisites: Composition or Literature Survey; G11 or above.",
	"104": "This course provides an overview of the establishment of the early church, and focuses on the various peoples of the early church. The first semester focuses on a chronological study of the book of Acts. The second semester looks at the book of James and the Epistles. The course is designed to combine a study of historical events with personal application. Through the study of Acts, students will explore how the Messenger (Jesus) became the center of the message. The study of James will help students understand the relationship between faith and works. Students will see the need to “walk the walk” and “talk the talk.”\n",
	"108": "This class is open to musicians who are interested in deepening their study of music in respect to worship musicianship. Students will study practical music theory with the goal of composing their own music. Students will also compose their own prose and learn how to write lyrics for songs. Students will deepen their faith as they will study what the Bible says about music and praise and worship. There will be a strong emphasis on the practice of prayer and biblical study of prayer. Also, there will be an emphasis on the study of Psalms. Finally, students will learn some basics about recording their own music. Students will be required to record exemplary work for a class compilation. Note: Some keyboarding or guitar skills would be helpful, although not required. Note: G11 or 12 elective.",
	"109": "This course addresses the fundamental conflict all people must face between the conditional values of the world and the unchanging values of God’s Word. It will help our students to develop insight into the subtle ways we can be deceived by a result-oriented and self-focused society, and the consequences of taking that path in life. In particular, this course will help students prepare for their future as they begin to make decisions about life after graduation from ICS. Prerequisites: None. Note: This is a required course for G10.",
	"110": "We are immersed in popular culture every day of our lives the moment we engage online, watch television, and listen to music. It is a huge part of our everyday life, so how does God fit into this? Do God and popular culture live on different ends of the spectrum? Or is there a place for God to speak eternal truths about who we are and who He is in popular culture, where the sacred meets the secular? In this course we will explore the road in which our faith and culture can intertwine. We will explore how media influences our day-to-day choices and shapes our worldviews through the study of film. We will explore the nature of God and how He calls us to live out our Christian faith and how we as Christians can engage relevantly in a popular culture without pushing aside our faith and values. Note: G11 or 12 elective.",
	"111": "Students will look into the lives of difference-makers through the study of biblical and contemporary leaders such as Jesus, David, Nehemiah, and William Wilberforce. Students will examine leaders in society and determine whether they have had a positive impact or a negative impact. By examining the lives of these leaders, students will discover the character qualities necessary to impact the society around them. This course will enable students to develop their individual gifts and talents to become future leaders in their chosen field while giving them a biblical foundation for understanding what true leadership is. Note: G11 or 12 elective.",
	"112": "Through the beautiful songs and visions of Isaiah and the dreams of Nebuchadnezzar and Daniel, students will explore the fascinating world of the prophets. As students dig into these books they will discover a God of love, comfort, power, and majesty. Students will learn to read God's Word with understanding, hear His voice, encounter people like themselves, and catch a glimpse of the end of all time. Note: G11 or 12 elective.",
	"113": "What does living according to the Bible look like in the 21st century? What's the difference between being \"religious \" and actually having a relationship with Christ? How do we get along well with others? Take this course to understand for yourself what the Bible says about human relationships, sexual purity, spiritual gifts, dealing with your anger, hope in times of despair, and spiritual warfare. Note: G11 or 12 elective.",
	"115": "Students will develop an understanding of the concept of a life calling and learn about their God-given design as a basis for this calling. Students will discover how work and individual leadership is best understood from the perspective of their life calling. Students will evaluate their foundational values, unique design, and personal mission in an in-depth paper, then integrate the paper into a life and leadership plan. This course will give students direction as they plan to apply to university and choose courses of study. As they progress toward graduation, it is important for students to begin to understand that their lives are not just about having a job and making money, but about having a life-calling. Note: This is a required course for G11.",
	"117": "Is Christianity logical or reasonable? How can we explain why we believe in God? Is it possible to defend our beliefs when we encounter challenges to our faith from unbelievers? These are questions that many Christians have wrestled with. This course is an examination of the rationality of the Christian faith. More precisely, it examines how the Christian faith can be rationally defended against traditional and contemporary challenges. Note: This is a required course for G12.",
	"118": "The purpose of this course is to provide students with an overview of the six main world religions. Specifically, students will study Christianity, Judaism, Buddhism, Hinduism, Sikhism, and Islam. These religions will be studied from the perspective of key theological questions, such as, who is God, what is heaven and hell, what is the meaning of life? Also, students will receive an introduction into various cult groups. At the end of the course, each of these religions will be compared and contrasted to Christianity. Students will be challenged to use the knowledge gained in this course in furthering Christ’s Great\nCommission. Note: This is a required course for G10.",
	"119": "This experiential course is designed to take those who want to learn ancient and modern Christian practices to deepen their relationship with Christ. Learning through disciplines that are “hands on” and practical activities such as fasting, prayer, meditation, solitude, and various methods of prayerful reflection. Students will identify ways to grow in their personal and communal relationship with God, through the guided and directed inward and outward spiritual exercises. The course encourages an experiential path to a renewed mind in Christ. Prerequisites: G11 elective Note: Approval of course teacher required.",
	"207": "This course deepens students' understanding of sequences and series, statistics, data analysis, systems of equations, probability, binomial theorem, and elementary functions (linear, quadratic, polynomial, square root, circle, exponential, logarithmic, trigonometric, and parametric). Prerequisites: Algebra 1.",
	"208": "Students will learn the essential concepts needed to perform geometric proofs, as well as relationships of topics in two-dimensional and three-dimensional geometry. The topics to be covered are Introduction to Geometry, Basic Reasoning and Proofs, Parallel and Perpendicular Lines, Triangles, Polygons, Circles, Surface Area and Volume, Transformations, Trigonometry, and Enrichment Topics. Prerequisites: Algebra 1.",
	"209": "Students will examine the properties and real-world problem-modeling applications of various families of functions (linear, exponential, logarithmic, trigonometric, polynomial, rational, and parametric) using algebraic, numerical, and graphical perspectives. Prerequisites: Algebra 2; Geometry either pre-requisite or concurrent. G10 or above or approval from the Academic Dean.",
	"210": "Students will examine similar topics as the AP Statistics course (data production, \nprobability, statistical inference and hypothesis testing), but at a less theoretical and more practical level. This course will also emphasize data organization and interpretation as encountered in daily life. If students wish to take AP Statistics later they will receive a total of 1.5 credits for both courses. The Statistics course credit will be altered to a value of 0.5 once the AP Statistics course is completed. Prerequisites: Algebra 1, G10 or above.",
	"211": "An Advanced Placement Calculus AB course consists of a full high school academic year of work that is comparable to calculus courses in colleges and universities. It is expected that students who take an AP Calculus course will seek college credit, college placement, or both, from institutions of higher learning. The AP Calculus curriculum will spend some time on elementary functions, but most of the year will be devoted to topics in differential and integral calculus. Most colleges and universities grant advanced placement and credit to qualifying students as measured by the results of an AP Examination in May. Technology will be used regularly; therefore a graphing calculator is REQUIRED. Prerequisites: Pre-Calculus or Honors Pre-Calculus, Geometry; G11 or above or approval from the Academic Dean. Recommendation: A- in Pre-Calculus or B- in Honors Pre-Calculus.",
	"212": "This course is challenging and it meets together with AP Calculus AB. Students are assigned challenging Calculus work. The purpose is to prepare students to take first-semester calculus in university. Prerequisites: Pre-Calculus, and Geometry; G11 or above.",
	"215": "Students will learn the basic concepts needed to solve algebraic equations in one and two variables, as well as strategies in solving practical word-problem applications. The topics to be covered are Introduction to Algebra, Working with Real Numbers, Solving Equations and Problems, Polynomials, Factoring Polynomials, Fractions, Applying Fractions, Introduction to Functions, Systems of Linear Equations, Inequalities, Rational and Irrational Numbers, and Quadratic Functions. Prerequisites: None.",
	"216": "Students will examine data production (through observational or experimental studies), data organization and description, probability as a foundation for understanding statistical inference, and statistical inference and hypothesis testing (for population means, proportions, and distributions). This course is essentially equivalent to a first semester university statistics course. Students who score well on the external AP statistics exam may receive university credit. Prerequisites: Algebra 2; G10 or above.",
	"219": "This course prepares students to take the AP Calculus BC exam. Students learn all of the skills and concepts from AP Calculus AB, as well as additional topics such as Taylor series, the basic calculus of parametric and polar functions, Euler's method, integration by parts, and partial fractions. Prerequisites: A- or above in Honors Pre-Calculus, Geometry; G11 or approval from the Academic Dean.",
	"251": "Students will learn the essential concepts needed to perform geometric proofs, as well as relationships of topics in two-dimensional and three-dimensional geometry. The topics to be covered are Introduction to Geometry, Basic Reasoning and Proofs, Parallel and Perpendicular Lines, Triangles, Polygons, Circles, Surface Area and Volume, Transformations, Trigonometry, and Enrichment Topics. Prerequisites: Algebra 1.",
	"252": "Students will examine the properties and real-world problem-modeling applications of various families of functions (linear, exponential, logarithmic, trigonometric, polynomial, rational, and parametric) using algebraic, numerical, and graphical perspectives. Prerequisites: Algebra 2; Geometry either pre-requisite or concurrent. G10 or above or approval from the Academic Dean.",
	"305": "Asian Studies aims to provide students with a multi-disciplinary perspective of Asia. The regional history, geography, as well as philosophies and religions will be applied to the analysis of current problems, trends and events in the wider region. Prerequisite: Modern European History; this is a required course for G10.",
	"306": "Microeconomics is designed to provide a thorough understanding of the principles of economics that apply to the functions of individual decision makers, both consumers and producers, within the larger economic system. It places primary emphasis on the nature and functions of product markets, and includes the study of factor markets and of the role of government in promoting greater efficiency and equity in the economy. Prerequisites: Two credits of social studies; G11 or above.",
	"307": "Macroeconomics is designed to give the student a thorough understanding of the principles of economics that apply to an economic system as a whole. The course places particular emphasis on the study of national income and price determination, and also develops familiarity with economic performance measures, economic growth, and international economics. Prerequisites: Two credits of social studies; G11 or above.",
	"309": "Psychology translates into the “study of the soul”, and explores a vast array of topics such as personality, stress, human development, parenting styles, psychological disorders, the nervous system, conformity, learning, and more. This course introduces students to the science of psychology from a biblical Worldview. Students who choose to take this course will gain a much deeper understanding of self, others, and the world around them. Prerequisites: Two credits of social studies; G11 or above.\nNote: Students should choose between Introduction to Psychology and AP Psychology. Introduction to Psychology is not a pre-requisite to AP Psychology, and students who take Introduction to Psychology should not subsequently take AP Psychology. Generally, students taking Introduction to Psychology are required to only complete ½ of the course expectations in AP Psychology in the areas of quizzes, tests, learning objectives, and semester exams.",
	"310": "This course provides an overview of the geography, culture, and history of Modern Europe. In order to facilitate the study of this era, it is broken down into five major units: The Rise of Democracy; Industrialism; Nationalism and Imperialism; World War in the Twentieth Century; and The World Since 1945. Note: This is a required course for G9.",
	"312": "Introduction to Human Rights aims to define Human Rights as expressed by the international community and the Christian community. The course places importance on a range of case studies where human rights have been violated. These cases are examined within a historical of the country, region or place and, these case studies are also analyzed from the perspective of the victims and the perpetrators. Prerequisites: G10 or above.\n",
	"314": "Introduction to Human Rights aims to define Human Rights as expressed by the international community and the Christian community. The course places importance on a range of case studies where human rights have been violated. These cases are examined within a historical of the country, region or place and, these case studies are also analyzed from the perspective of the victims and the perpetrators. Prerequisites: G10 or above.\n",
	"315": "Middle East Studies aims to provide students with a multi-disciplinary perspective on Southwest Asia. Careful examination of the regional history, geography, and religious milieu will be applied to the analysis of current problems, trends, and events in the wider region. Middle East Studies is a one-semester course. Prerequisites: Modern European History and Asian Studies; G11 or above. Note: Honors Middle East Studies is a recommendation for AP World History when offered. (This prerequisite may be waived with teacher approval).",
	"316": "AP World History builds upon concepts and content from all of the prerequisite social studies courses to compare world civilizations, analyze their interactions, and their development over time. Given the wide breadth of subject matter it would benefit students to take as many history and literature courses as possible prior to enrolling in AP World History. Students may challenge the AP World History exam in order to gain university credit. Prerequisites: Modern European History and Asian Studies; G10 with a 95% grade in Modern European History, G11 or above with recommendation from course teacher. Students are also recommended to take one of: Introduction to Human Rights, Middle East Studies, American and British Literature Honors, AP United States History, AP European History.",
	"317": "The purpose of AP Psychology is to introduce the systematic and scientific study of the behavior and mental processes of human beings from a Christian Worldview. Included is a consideration of the psychological facts, principles, and phenomena associated with each of the major subfields within psychology, such as the history of psychology, the biological basis for psychology, human development, cognition, personality, and abnormal psychology and treatment. Students also learn about the ethics and methods psychologists use in their science and practice. Psychology is an extremely useful and diverse course, with relevance to students interested in business, education, medicine, law, and sports. It is often a prerequisite in the aforementioned fields in university. AP psychology provides a learning experience equivalent to that obtained in most college introductory psychology courses. Prerequisites: Two credits of social studies; G11 or above. Note: Students will have to choose either Introduction to Psychology or AP Psychology, not both. (See note to Introduction to Psychology).",
	"318": "Microeconomics is designed to provide a thorough understanding of the principles of economics that apply to the functions of individual decision makers, both consumers and producers, within the larger economic system. It places primary emphasis on the nature and functions of product markets, and includes the study of factor markets and of the role of government in promoting greater efficiency and equity in the economy. Prerequisites: Two credits of social studies; G11 or above.",
	"319": "Macroeconomics is designed to give the student a thorough understanding of the principles of economics that apply to an economic system as a whole. The course places particular emphasis on the study of national income and price determination, and also develops familiarity with economic performance measures, economic growth, and international economics. Prerequisites: Two credits of social studies; G11 or above.",
	"320": "The study of European history since 1450 introduces students to cultural, economic, political, and social developments that played a fundamental role in shaping the world in which they live. Without this knowledge, we would lack the context for understanding the development of contemporary institutions, the role of continuity and change in present-day society and politics, and the evolution of current forms of artistic expression and intellectual discourse. In addition to providing a basic narrative of events and movements, the goals of AP European History are to develop (a) an understanding of some of the principal themes in modern European history, (b) an ability to analyze historical evidence and historical interpretation, and (c) an ability to express historical understanding in writing. Prerequisites: Modern European History and Asian Studies; G10 with a 95% grade in Modern European History, G11 or above.",
	"321": "This course surveys and explains the cultural, linguistic and biological legacy of humankind, from antiquity to the present, using the research tools of anthropology. Anthropology is both a scientific and humanistic endeavor that attempts to explain the differences and similarities between and among human groups. Anthropology studies where people come from, who they are, what they do, and why they do it. The study of these principles will be grounded in a biblical/Christian worldview perspective. This course will run if staffing allows. Prerequisite: G11 or above.",
	"322": "Introduction to Sociology analyzes human interaction and studies the application of scientific methods in the observation and analysis of social change, norms, groups, intergroup relations, social stratification, institutions, and basic socialization processes. This course provides information to guide students in developing an awareness of the processes involved in human interaction. To this end, the course is designed to provide students with opportunities to learn the basic elements of sociology as an analytical behavioral science, while also considering biblical and Christian worldview perspectives related to human development. This course will run if staffing allows. Prerequisite: G11 or above.",
	"330": "AP Seminar is a foundational course that engages students in cross-curricular conversations that explore the complexities of academic and real-world topics and issues by analyzing divergent perspectives. Students will use an inquiring framework to practice reading and analyzing articles, research studies, and foundational literary and philosophical text. They will also listen to and view speeches, broadcasts, and personal accounts, and experience artistic works and performances. Students will learn to synthesize information from multiple sources, develop their own perspectives in research-based written essays, and design and deliver oral and visual presentations, both individually and as part of a team. Ultimately, the course aims to equip students with the power to analyze and evaluate information with accuracy and precision in order to craft and communicate evidence-based arguments. Prerequisite: G11 or above with an A grade in Composition, Literature Survey, or Asian Studies; or with teacher recommendation.",
	"350": "Middle East Studies aims to provide students with a multi-disciplinary perspective on Southwest Asia. Careful examination of the regional history, geography, and religious milieu will be applied to the analysis of current problems, trends, and events in the wider region. Middle East Studies is a one-semester course. Prerequisites: Modern European History and Asian Studies; G11 or above. Note: Honors Middle East Studies is a recommendation for AP World History when offered. (This prerequisite may be waived with teacher approval).",
	"405": "This course introduces students to the basic principles of biology and prepares them for more advanced study later on. Units include: Cells, Genetics, Evolution/Creation, Classification/Viruses/Bacteria, Protists/Fungi/Plants, Animals, and Ecology. Prerequisites: None. Note: This is a required course for G9.",
	"407": "This elective course introduces students to the basic principles of chemistry. Units covered include Atoms/Nuclear Chemistry/Elements/Periodicity, Bonding, The Mole/Stoichiometry, Reactions/Equations, States of Matter, Solutions/Equilibrium, Acids/Bases, and Organic Chemistry. Prerequisites: Biology; G10 or above.",
	"410": "The aim of this course is to introduce students to scientific method and inquiry-based learning in the specific context of forensic science (science for the courts). The course is designed to utilize a wide range of scientific skills. Topics will include: crime scene, types of evidence, analysis of fingerprints, ballistics, blood analysis and blood splatter, autopsy, and drugs. Prerequisites: None; G10 or above.",
	"415": "This elective course provides students with a basic understanding of Earth Science and Geology. Units covered include the Earth in Space, Model of the Earth, Tectonics, Earth Chemistry, Rocks and Minerals, Resources and Mining, Weathering and Erosion, Rock Records and the History of Continents. Some studies in astronomy will also be included. Prerequisites: None; G10 or above.",
	"416": "Environmental science is a project based inquiry course that provides an introduction to the study of the environment. Students will study science as a process as it relates to the diversity and interconnectedness of ecosystems, the underlying chemistry of environmental issues, Energy and alternatives, and the large-scale impact that humans have on the environment. Prerequisites: Biology; G10 or above.",
	"417": "In this course we study the systems of the human body, focusing on specific organs and their functions. We will also look at diseases common to each system. This course is recommended (but not required) for those preparing to take AP Biology. Students who have already taken AP Biology may find this course somewhat repetitive, but we are able to cover more of the human body at a slower pace. Prerequisites: Biology; G10 or above.",
	"420": "The goal of the AP Environmental Science course is to provide students with the scientific principles, concepts, and methodologies required to understand the interrelationships of the natural world, to identify and analyze environmental problems both natural and human-made, to evaluate the relative risks associated with these problems, and to examine alternative solutions for resolving and/or preventing them.\nEnvironmental science is interdisciplinary; it embraces a wide variety of topics from different areas of study. Yet there are several major unifying constructs, or themes, that cut across the many topics included in the study of environmental science. The following themes provide a foundation for the structure of the AP Environmental Science course:Energy conversions underlie all ecological processes.\nThe Earth itself is one interconnected system.\nHumans alter natural systems.\nEnvironmental problems have a cultural and social context.\nHuman survival depends on developing practices that will achieve sustainable systems. Prerequisites: Biology and Chemistry.Environmental Science would be an advantage;G11 or above.",
	"421": "The aim of the course is to provide an in-depth introduction to the core topics in physics. It is equivalent to a first-semester college course in algebra-based physics. The course covers Newtonian mechanics (including rotational dynamics and angular momentum); work, energy, and power; and mechanical waves and sound. It also introduces electric circuits. The teaching style is interactive and has a strong experimental and practical component. Prerequisites: Biology and Algebra 2; G11 or above. Note: Geometry and Pre-Calculus are recommended prior to or concurrent with taking Physics, but are not required.",
	"422": "This elective course is designed to be the equivalent of a college-level, algebra-based physics course. Topics covered include: Newtonian Mechanics, Fluid Mechanics and Thermal Physics, Electricity and Magnetism as well as Atomic and Nuclear Physics. Students who score well on the external AP Exam may receive college credit. Prerequisites: AP Physics 1; G12.",
	"430": "This elective course is designed to be the equivalent of an introductory college biology course. This is now a completely new and revised course. The course will concentrate on learning the objectives through course work and inquiry but without the full range of inquiry-based labs. The emphasis is on context rather than content, with emphasis on inquiry-based learning in science. The Advanced Honors Biology course is now focusing on four Big Ideas and will investigate: Evolution, Metabolism, Cells and Communication systems, Homeostasis and Coordination, Genetics, and Ecology. Prerequisites: Biology and Chemistry; G11 or above.\n",
	"435": "This elective course is designed to be the equivalent of an introductory college biology course. The emphasis is on context rather than content, with emphasis on inquiry-based learning in science. The AP Biology course is now focusing on four Big Ideas and will investigate: Evolution, Metabolism, Cells and Communication systems, Homeostasis and Coordination, Genetics, and Ecology. Minor labs are included but all major inquiry labs are completed during the AP Biology lab course. The theoretical aspects of the labs are part of this class. Students who sign up for this course must also sign up for the AP Biology Lab Course and will receive one and a half credits total. Students who score well on the external AP Exam may receive college credit. Prerequisites: Biology and Chemistry; G11 or above.",
	"436": "This elective will allow the students to have time to develop and undertake inquiry-based lab experiments. Some of the labs will be long-term and require repetition to produce statistically valid results. Labs will include BLAST analysis, Diffusion and Osmosis, investigation of enzymes, cellular respiration of insects, photosynthesis, transpiration, bacterial transformation, and crime scene investigation using electrophoresis and animal behavior labs. Assessment will be by a range of presentations of the lab reports. This course must be done either before or in conjunction with, AP Biology course work. Note: G11 or above.",
	"440": "This elective course is designed to be the equivalent of an introductory college Chemistry course. The course will concentrate on learning the objectives through course work and inquiry but without the full range of inquiry-based labs. The emphasis is on context rather than content, with emphasis on inquiry-based learning in science. The Advanced Honors Chemistry course will focus on Six Big Ideas and will investigate: Atomic Structure, Physical Properties of Matter, Chemical Reactions, Rates of Reactions, Thermochemistry, and Equilibrium. Students who complete this course could attempt the external AP Exam though they will not have covered the Lab Questions. Prerequisites: B grade or higher in Honors Chemistry; G11 or above.",
	"445": "This elective course is designed to be the equivalent of an introductory college chemistry course. Students who score well on the external AP Exam may receive college credit. The Course will focus on Six Big Ideas and will investigate: Atomic Structure, Physical Properties of Matter, Chemical Reactions, Rates of Reactions, Thermochemistry, and Equilibrium. Students who sign up for this course must also sign up for the AP Chemistry Lab Course and will receive one and a half credits total. Students who complete this course will receive the AP Chemistry designation on their transcript and can attempt the external AP Exam which may result in College Credit. Prerequisites: B grade or higher in Honors Chemistry; G11 or above.\n",
	"446": "This elective will allow the students to have time to develop and undertake inquiry-based lab experiments. Some the labs will be long-term and require students to design experiments as they carry out inquiry-based lab work. Labs will include: Spectrophotometry, Gravimetric Analysis, Titrations, Chromatography, Qualitative Analysis, Redox Reactions, Kinetics, Equilibrium and Acid Base Experiments. Assessment will be by a range of lab reports and lab test. This course must be done in conjunction with AP Chemistry course work. Note: G11 or above.",
	"450": "This course introduces students to the basic principles of biology and prepares them for more advanced study later on. Units include: Cells, Genetics, Evolution/Creation, Classification/Viruses/Bacteria, Protists/Fungi/Plants, Animals, and Ecology. Prerequisites: None. Note: This is a required course for G9.",
	"451": "This elective course introduces students to the basic principles of chemistry. Units covered include Atoms/Nuclear Chemistry/Elements/Periodicity, Bonding, The Mole/Stoichiometry, Reactions/Equations, States of Matter, Solutions/Equilibrium, Acids/Bases, and Organic Chemistry. Prerequisites: Biology; G10 or above.",
	"453": "The aim of the course is to provide an in-depth introduction to the core topics in physics. It is equivalent to a first-semester college course in algebra-based physics. The course covers Newtonian mechanics (including rotational dynamics and angular momentum); work, energy, and power; and mechanical waves and sound. It also introduces electric circuits. The teaching style is interactive and has a strong experimental and practical component. Prerequisites: Biology and Algebra 2; G11 or above. Note: Geometry and Pre-Calculus are recommended prior to or concurrent with taking Physics, but are not required.",
	"454": "The aim of this course is to introduce the concepts of Physics, as a project and inquiry – based Engineering unit. The course is designed to include a range of engineering projects such as bridge building, roller coasters, medieval catapults, robotics, and using recycled materials to construct a boat. These will be used, through inquiry, to teach concepts such as Newton’s Laws of motion, dynamics, mechanics, electro-magnetism and energy to name a few. Students will also learn and use the math involved, and how to analyze and evaluate their projects. This course will be considered a prerequisite for AP Physics 1, but can be studied by anyone who wants to really exercise his or her brain. Prerequisite: None; G10 or above\n",
	"533": "Students will explore and define the complexity of health and its effect on our relationships and purpose. They will reflect and analyze their past health in terms of health influences and accessibility of information, products and services. They will investigate a variety of health concepts before examining those in which they are personally interested, choosing from such topics as nutrition, rest, relationships, emotional well-being, addictions and change theory. Students will demonstrate skills including goal setting, action planning, self-managing, analyzing, communicating, and decision-making as they seek to enhance their own health. Students will examine in-depth a topic of inquiry based on personal curiosity and/or concern, demonstrating research, interpersonal, communication, and advocacy skills related to health promotion. Students will also demonstrate competency in first aid and CPR. Prerequisite: G10 or above. This course is a graduation requirement.",
	"538": "Students will explore and define the complexity of health and its effect on our relationships and purpose. They will reflect and analyze their past health in terms of health influences and accessibility of information, products and services. They will investigate a variety of health concepts before examining those in which they are personally interested, choosing from such topics as nutrition, rest, relationships, emotional well-being, addictions and change theory. Students will demonstrate skills including goal setting, action planning, self-managing, analyzing, communicating, and decision-making as they seek to enhance their own health. Students will examine in-depth a topic of inquiry based on personal curiosity and/or concern, demonstrating research, interpersonal, communication, and advocacy skills related to health promotion. Students will also demonstrate competency in first aid and CPR. Prerequisite: G10 or above. This course is a graduation requirement.",
	"539": "Students will explore and define the complexity of health and its effect on our relationships and purpose. They will reflect and analyze their past health in terms of health influences and accessibility of information, products and services. They will investigate a variety of health concepts before examining those in which they are personally interested, choosing from such topics as nutrition, rest, relationships, emotional well-being, addictions and change theory. Students will demonstrate skills including goal setting, action planning, self-managing, analyzing, communicating, and decision-making as they seek to enhance their own health. Students will examine in-depth a topic of inquiry based on personal curiosity and/or concern, demonstrating research, interpersonal, communication, and advocacy skills related to health promotion. Students will also demonstrate competency in first aid and CPR. Prerequisite: G10 or above. This course is a graduation requirement.",
	"540": "Students receive instruction in a variety of activities in order to learn key concepts applicable to all activities. Preqrequisites: None",
	"549": "This course is not an introductory course. It is an extension beyond the grade 10 PE courses. It is designed for students who are interested in a wide range of physical activities, who understand the importance of lifelong fitness, and who desire to learn the theory of how to maintain it. Students work on individual skills and learn team concepts and strategies that will enable them to be fit and healthy at whatever level they choose for the rest of their lives. In addition, students are taught basic knowledge of the sports sciences (Functional Anatomy, Exercise Physiology, Fitness Studies, Motor skill learning and Biomechanics) as related to the activities in which they are involved.",
	"550": "This course is not an introductory course. It is an extension beyond the grade 10 PE courses. It is designed for students who are interested in a wide range of physical activities, who understand the importance of lifelong fitness, and who desire to learn the theory of how to maintain it. Students work on individual skills and learn team concepts and strategies that will enable them to be fit and healthy at whatever level they choose for the rest of their lives. In addition, students are taught basic knowledge of the sports sciences (Functional Anatomy, Exercise Physiology, Fitness Studies, Motor skill learning and Biomechanics) as related to the activities in which they are involved.",
	"551": "Students receive instruction in a variety of activities that challenge them to extend the skills and knowledge learned in grade 9. Teachers cover a combination of games/activities in order to teach key concepts applicable to all activities.",
	"552": "Students receive instruction in a variety of activities that challenge them to extend the skills and knowledge learned in grade 9. Teachers cover a combination of games/activities in order to teach key concepts applicable to all activities.",
	"571": "Members of the high school football team can apply to receive PE credit for football participation and leadership. Students must be part of the MAD (Make A Difference) course that works with elementary football students and must also participate in the autumn football tournament and Season 3 football. The course will have two elements:\n● Team Training: Team evaluation and self-evaluation of the student’s performance.",
	"615": "In French 1, students learn the basics rules of grammar. They conjugate regular and irregular verbs in the present tense and use them in sentences, use negation and interrogation styles, use definite and indefinite articles, and they demonstrate use of gender number agreements. Students demonstrate use of the language in personal situations, respond to and initiate greetings, know every day basic expressions and use adjectives to describe friends, family, and common everyday objects. Students demonstrate an ability to express orally in French by reproducing basic sounds, short exchanges, likes & dislikes, respond to structured questions and seek basic information. French cultural knowledge regarding basic holidays, school life and living patterns, and French-speaking countries are targeted. Prerequisites: None.",
	"616": "In French 2 students continue to develop grammar such as futur proche, additional regular verbs, and extending sentences. They expand their usage of spoken and written work authentically through the content areas of sports and leisure, festivals and parties, vacationing, and transportation. Students look more in depth at the lifestyles of both French and other Francophone people; comparing the two. Prerequisites: students who attained a pass in HS French 1, MS French 1, or equivalent.",
	"617": "While strengthening existing language skills, French 3 focuses on handling more linguistically advanced work. Students summarize short readings and TV programs; read short essays by recognized authors, answering questions based on the stories. They exhibit and expand vocabulary in the French home, school systems, universities, governments and family relationships; deriving word families-verbs, adjectives, and nouns. Grammar focuses on past tenses to the present tense, and differentiates when to use each. Increased knowledge of French culture includes recognition of famous art works, several painters, composers and writers. Prerequisites: students who attained a pass in HS French 2 or equivalent.",
	"618": "French 4 is intended for students who are interested in studying the language in more depth. While strengthening existing language skills, the course seeks to give students an understanding of the cultural histories of Francophone countries, as well as a smorgasbord of current and relevant daily life activities. Imperative, past simple, conditional and subjunctive tenses are introduced. Students also delve into some French literature extracts, novels, film studies and other contemporary material. Prerequisites: students who attain a pass in HS French 3 or equivalent.",
	"619": "French 5 is intended for students who are interested in taking the AP French exam and studying the language in more depth. The course prepares students to sit for the AP French examination. Students will gain experience with the college-level work and improve their chances of getting into competitive colleges. Students who do well on the AP examination may receive advanced credit, placement, or both at certain institutions. Exemption is subject to individual colleges and universities. Prerequisites: students who attain a pass in HS French 4 or equivalent.",
	"643": "This CC course introduces the rules of Pinyin – the Romanization system, basic vocabulary and simple grammar. Students will demonstrate use of the language in daily situations, describing friends, family and common daily objects. Students will read and write with the assistance of Pinyin, and express orally in Putonghua or in written form one’s opinions with basic information. Prerequisites: students who finished MSCC Foundation, MSCC 1, or with no previous knowledge in Chinese language",
	"644": "This CC course continues to develop the basic communication skills. More vocabulary and sentence structures regarding spatial relationship, directions, distance measurements, daily routines and living environment are covered. Foundation skills of Listening, Speaking, Reading and Writing are developed. Students will read and write with less assistance of Pinyin, and demonstrate more complex ideas in Putonghua and/or in Chinese characters. Chinese culture is introduced and the accuracy in Chinese character writing is expected. Prerequisites: students who attained a pass in the HS Chin Com 1, MSCC2, or equivalent",
	"646": "This CC course continues to further develop the language ability in the four macro skills. Authentic materials are adopted in discussing Chinese culture and Cross-cultural awareness. Students will read and write with little assistance of Pinyin. A variety of practical genres is introduced for communication both in Putonghua and in writing. Critical thinking is involved in making personal judgment and from a biblical perspective. Students will be recommended to sit for SAT II Chinese Subject test during the course. Prerequisites: students who attained a pass in the HS Chin Com 2, MSCC3, or equivalent.",
	"647": "This CC course is comparable to a fourth semester (or the equivalent) college or university course in Mandarin Chinese. It aims to help students develop proficiency and knowledge of Chinese culture in greater depth. The course prepares students to sit for the AP Chinese examination. Students will gain experience with the college-level work. Students who do well on the AP examination may receive advanced credit, placement, or both at certain institutions. Exemption is subject to individual colleges and universities. Prerequisites: students who attained a pass in the HS Chin Com 3, MSCC4, or equivalent.",
	"649": "This CC honors course is a high level in the Chinese Communication Stream. Students will be guided to further develop the ability to communicate in Chinese through learning more advanced and commonly used structures. Topics like social issues, economic issues, political issues and various aspects of Chinese culture will be incorporated in the course. Students will be exposed to articles in a variety of text types and learn to write in various literary forms. Prerequisites: students who attained a pass in the HS AP Chin Com 4, or equivalent.",
	"650": "This CC honors course is the highest Chinese level of the CC stream. The aim of this course is to enhance students’ ability in using Chinese with a variety of vocabulary and syntax. The listening and speaking exercises take various forms, and are carefully designed to reflect the real Chinese speaking world. Students are also provided with various reading and writing opportunities to use the language in real situations. Prerequisites: students who attained a pass in HS Adv Hon Chin Com 5, or equivalent.",
	"654": "This CL honors course aims to further enhance the skills on listening, speaking, reading, writing and typing Chinese. Customs of different races in China and folklores will be studied. Literature extracts in a variety of genres will be integrated as study materials. Writing of formal application letters, movie critics and illustrative writings will be adopted to further develop the writing skill. Prerequisites: students who attained a pass in HS Adv Hon Chin Lit 7, MSCL8, or equivalent.",
	"661": "In this CL honors course, students will be introduced to articles in a variety of genres. A number of contemporary writers and the history of the Chinese New Cultural Movement will be studied. Students also delve into some literature extracts and other contemporary materials. Writing will be more focused on descriptive and formal letter writing form. Oral presentations, story-telling and speeches with convincing messages are practiced in enhancing students’ speaking skill. Prerequisites: students who attained a pass in HS Adv Hon Chin Lit 8, MSCL9, or equivalent.",
	"662": "This CL honors course aims to further develop students’ listening, speaking, reading and writing skills. Literatures written by writers from different countries will be studied. Some Chinese historical and famous figures will be introduced too. Students are expected to express themselves in descriptive writing, lyric writing, as well as argumentative writing. Critical thinking will be involved in listing one’ s arguments.Students will also further develop their speaking skills in making presentations and movie critics.Prerequisites: students who attained a pass in HS Adv Hon Chin Lit 9,or equivalent.",
	"663": "This CL honors course is the highest level in CL stream. Students will be guided to appreciate and compare different literature pieces of famous writers from Singapore, Taiwan, Hong Kong and Mainland China. Extensive reading from literatures in either Traditional Chinese characters or Simplified Chinese characters will be studied in this course. Students will have the opportunity to further strengthen oral communication skills through drama, news reports, and debates in Putonghua. Prerequisites: students who attained a pass in HS Adv Hon Chin Lit 10, or equivalent.",
	"671": "This CL honors course is designed for students who have demonstrated a foundational level in reading and writing Chinese language. It aims to enhance the usage of the language by inputting a variety of vocabulary and syntax. Students will be taught doing narrative writing with an emphasis on scenery narration and illustrative writing in object illustration. Prerequisites: students who attained a pass in MSCL7 or equivalent",
	"707": "Picking up where Drawing 1 left off, this course will include colored media such as colored pencil and oilbar. Recommended for G10 and G11 students considering advanced or AP Studio Art in the future, or for students interested in improving drawing skills. Prerequisites: Drawing 1 or permission of the instructor; G10 standing or above.",
	"708": "Students who have completed Painting 1 can continue developing their painting skills in this course. Recommended for G10 and G11 considering Advanced or AP art in the future. Prerequisites: Painting 1 or permission of the instructor; G10 or above.",
	"709": "This course provides a practical and hands-on opportunity for students to develop more media skills by producing their own film. They will also develop independent management skills, creativity, and time management. Students will apply the skills learned in many of the introductory level courses (media production, planning, post production editing) and the senior level courses (analyzing different types and methods used in various film productions). Although this is an unscheduled course, students will be required to set regular meetings with the media studies teacher to gain feedback on their progress and ideas. Students who take this course should ensure that they have a suitable course schedule to allow time for production and editing. They need to be able to work independently with the technical aspects of producing a film or other media products and have demonstrated exemplary media skills and self-directedness. Prerequisites: G11 or above with extensive experience with the filming and software technology. Teacher selection: this course is limited to five students. Students should complete an ‘Independent Filmmaking Application Form’. Forms are available from the Media Studies teacher and the secondary office.",
	"711": "This course introduces students to two major paint types: watercolor and acrylic. The first half of the course will consist of watercolor work, with acrylic study beginning in the second half. The course is offered in the second semester, and is available to all grade levels. Freshmen students with an interest in art are encouraged to take this course as a follow up to the first semester Drawing course as a beginning to their education in the visual arts. Others interested in taking a basic art course are encouraged to join. Prerequisites: None.",
	"712": "Concentrating entirely on enhancing drawing skills, this first semester course will include the black and white media of graphite, charcoal, and pen and ink. Available to all grade levels, this course provides a good starting point for incoming freshmen who are interested in following a visual arts track in high school, or for anyone interested in taking a basic art course. Prerequisites: None.\n",
	"714": "As with photography, this course is aimed at the practical arts. Students will cover graphic design and composition through projects such as layout design, advertising design, poster design, and product design. Emphasis will be on the design and composition aspect of printed material graphics. Students will learn both the Adobe Indesign program and the Adobe Photoshop program; prior knowledge of the program is not necessary. Prerequisites: G10 or above. Note: This course is also available for computer credit (see course 817).",
	"715": "The history of photography will be briefly covered, but the main goal of the course is to increase understanding of the camera. Projects will be designed to incorporate different functions of a single lens reflex (SLR) camera. Students will experiment both with darkroom printing techniques and digital techniques. Prerequisites: None. Note: Students must have an advanced SLR camera with automatic and manual functions, either film or digital. The school provides film, cardstock paper for mounting prints, some developing, and a limited number of enlargements/photo papers, but at times students may be required to pay for developing themselves. Prerequisites: G10 or above.",
	"716": "Students will produce the memoire, including photography, design, layout and composition. Students will also learn the Adobe InDesign program. In addition, the yearbook staff needs writers and graphic artists. Open to juniors and seniors, the team especially needs a core of juniors who will commit to two years on staff. Prerequisites: One year of high school art or permission of instructor; G11 or above.",
	"717": "This yearlong course is designed for those who are both strongly interested and highly skilled in art, and who are considering a career in the visual arts. In addition to project work, students will complete a number of out-of-class assignments and a substantial art history unit. Students considering AP Art are recommended to take this class as juniors, in order to build a strong portfolio for their AP year. The course is an Honors Level course. Prerequisites: One year of high school art; it is preferred for students to have taken at least one drawing and at least one painting class; G11 or above.",
	"718": "This course is the culmination of the high school art courses. Although all interested students who have met the prerequisites are welcome, AP art is specifically aimed at those who are considering art schools for university and art as a career. Students will complete a thematic twelve-piece portfolio of their own concepts and design, concentrating on techniques and media they excel in. Any medium is acceptable, from drawing and painting to photography and computer design to 3D work. Participants have the option of submitting the portfolio to The College Board for Advanced Placement credit. Prerequisites: For students who anticipate creating a drawing or 2D design portfolio, one year of high school art is required, although two or more are preferred; for students who anticipate producing a photography portfolio, one semester of photography is required, preferably two; for students who anticipate producing a digital design portfolio, one semester of Graphic Design is required, preferably two; for students who anticipate producing a 3D portfolio, one year of 3D art is required (3D art and Ceramics courses count toward this requirement). This course is open to G12 only.",
	"733": "This course will concentrate on creating art that is not confined to a two-dimensional surface. Throughout the semester, students will experiment with a variety of materials and processes to form sculptural art. Prerequisites: None.",
	"737": "This large ensemble is for beginning level choral performers. The curriculum includes instruction in proper singing habits such as correct posture, breathing and tone production, singing in a world language, and basic music theory. Performances include the Christmas and Spring Concerts, as well as possible community events. Prerequisites: None.",
	"753": "This select mixed ensemble with advanced vocal and performance skills combines the study of musical theater and singing in the following musical styles: gospel, pop, jazz and Broadway musicals. In addition to techniques of rehearsal and performance, the student will develop sight-reading skills, basic aural skills, and will participate in the creation of choreography for the music learned. Show Choir will present a production in the first semester. This is an intensive course, requiring some extra rehearsals: two Saturday rehearsals – choreography “camp” and a Dress Rehearsal on the week before the production and three afternoons of rehearsal outside of class in order to receive credit for the course. Prerequisites: Audition and teacher permission.",
	"754": "This course is an addition to our 3D art program with its focus on the complete ceramics process. Fundamental techniques in clay formation, decoration, and glazing are taught. The student will be exposed to both hand built pottery projects, as well as being introduced to the potter's wheel. Prerequisites: None.",
	"762": "This course introduces students to the technical skills used in the performing arts, including sound, lighting, staging, stage-management, rigging, video, and multimedia. While working with these technologies, students will study the relevant underlying principles in applied science, engineering, and Physics. The class format will be an interactive seminar style. Students will be required to attend certain performances during the year as part of our class evaluation of the technology used in the performances. Hands-on learning will take place at events and programs, on and off campus, where students will have the opportunity to practice their skills. Students are expected to have a reasonable level of fitness and dedication due to the oftentimes long hours and physically demanding support needed at such events. Prerequisites: Fall Semester: None; Spring Semester: Previous theater technology experience.",
	"763": "This is the high school band for students of above average musical maturity and skill. It is designed for students who have the determination and ability to perform at the highest level. Students will learn to perfect the fundamentals of instrumental performance and will perform a varied repertoire of musical compositions and styles. This band is involved in special competitions, as well as the Christmas and Spring concerts. Prerequisites: Director’s recommendation and audition. Students should have at least two years of experience with their band instrument.",
	"764": "Students will learn to perfect the fundamentals of instrumental performance and will perform a varied repertoire of popular and lighter musical styles and compositions. This band is involved in special competitions, as well as the Christmas and Spring concerts. Prerequisites: Students should have at least one year of experience with their band instrument.",
	"765": "This large ensemble is for intermediate to advanced level choral performers. The curriculum includes instruction in proper singing habits such as correct posture, breathing and tone production, singing in a world language, and basic music theory. Performances include the Christmas and Spring Concerts, as well as community events. Prerequisites: Audition and teacher permission.",
	"766": "This large ensemble is for intermediate level choral performers. The curriculum includes instruction in proper singing habits such as correct posture, breathing and tone production, singing in a world language, and basic music theory. Performances include the Christmas and Spring Concerts, as well as community events. Prerequisites: Audition and teacher permission.",
	"782": "Building on the skills learned in the Ceramics 1 course, students will increase mastery of pottery techniques. They will continue experimentation with both hand building and the wheel, and will have the opportunity to sculpt with clay using their own conceptual ideas in specific themes. Prerequisites: Ceramics 1.",
	"783": "Students will again focus on using the Adobe Indesign and Photoshop programs to create print graphics. In addition to using the computer to create practical designs, emphasis will also be placed on using the computer as a more creative tool for the purpose of producing digital artwork. Prerequisites: Graphic Design 1; G11 or above.",
	"784": "In Photography 2, students will experiment with more advanced techniques in either the darkroom or with digital photography. Photography 2 students can work towards building an AP Studio Art: 2D design portfolio during the course; grade 11 students can enroll in AP art the following year to continue their studies in photography, while grade 12 students can take the course simultaneously with AP art. Prerequisites: Photography 1; G11 or above. Note: Students must have an advanced SLR camera with automatic and manual functions, either film or digital.",
	"790": "The focus of this course is to build hands-on video and editing skills through the study of film genre. Students will engage in a variety of activities learning basic production processes, software such as Final Cut Pro and Adobe Photoshop, and equipment handling and usage, to create their own short genre scene. This is a basic introduction to the language of media. Students examine familiar fictional texts; analyzing genres from easily accessible forms such as TV or film. The skills learned in this course will enable students to have the production skills needed to help them move on in more context focused courses of media study. Prerequisites: None. Note: This course is also available for computer credit (see course 818).",
	"792": "The focus of this course is narrative film. Students engage with a range of narrative film styles and genre and are provided opportunities to examine how a story is told and represented, while engaging and entertaining audiences. Students analyze techniques in production and story elements in film, are introduced to film theories, examine the convention of movie trailers, and move on to writing their own narrative film while learning about aspects of production and portfolio work. Prerequisites: Introduction to Media Production or permission from instructor; G10 or above.",
	"797": "The focus of this course is popular culture such as that demonstrated by popular music videos and magazine. Students will understand the concept of ‘popular culture’ and subcultures prevalent in media products, the means utilized by audiences to engage with popular media, and learn to interpret codes and conventions used to create meanings and symbolism in and through these media works. They create their own print magazine and music video productions in Adobe InDesign and Final Cut Pro, as they apply their understanding of media language and production processes. Prerequisites: Introduction to Media Production or permission from instructor; G10 or above.",
	"798": "This course explores the concepts of representation and stereotypes through advertising and non-fiction media. Students view, listen to, and analyze relevant mainstream and commercial media texts as their experience of the language of media is reinforced. They examine how audiences’ are influenced and targeted through marketing tactics and generate their own responses to these texts. Student will also engage in a variety of activities learning basic production processes, software such as Final Cut Pro and Adobe Photoshop, and equipment handling and usage to create their own Advertising campaign & TV production. Prerequisites: Introduction to Media Production or permission from instructor. Note: This course is also available for computer credit (see course 820).",
	"800": "Many have wanted to have the chance to work on real audio sound mixes with professional mixing equipment… well, now you can! Audio Technology class gives students the opportunity to acquire the skills of audio mixing and production. This course fills a need for students to have the golden opportunity to produce “non-live” audio. Audio Technology also serves a dual role as it aids in the production of WOW musical audio tracks. This is a great opportunity for audio-loving, music-loving tech students. Prerequisites: Teacher recommendation. WOW preferable.",
	"804": "In this course students will study aspects of digital citizenship. They will gain an overview of computer systems, tools, and applications, and learn about implementing real-life technology. Students will investigate the concept of an icloud and learn to use helpful applications to enhance computational thinking. In addition, they will study computer networks, communication, data and security technologies, and productivity and database software features. They will practice hardware configurations, software adaptation, operating system installation, real-life networking projection, and safe Internet browsing. Lastly, students will investigate the social impact of computer technologies and develop an understanding of environmental and ethical issues related to the use of computers. Assessment will be creative and applicable to real life. Prerequisites: None.",
	"805": "This course provides a practical and hands-on opportunity for students to develop more media skills by producing their own film. They will also develop independent management skills, creativity and time management. Students will apply the skills learned in many of the introductory level courses (media production, planning, post production editing) and the senior level courses (analyzing different types and methods used in various film productions). Although this is an unscheduled course, students will be required to set regular meetings with the media studies teacher to gain feedback on their progress and ideas. Students who take this course should ensure that they have a suitable course schedule to allow time for production and editing. They need to be able to work independently with the technical aspects of producing a film or other media products and have demonstrated exemplary media skills and self-directedness. Prerequisites: G11 or above with extensive experience with the filming and software technology. Teacher selection: this course is limited to five students. Students should complete an ‘Independent Filmmaking Application Form’. Forms are available from the Media Studies Teacher and the secondary office.",
	"817": "As with photography, this course is aimed at the practical arts. Students will cover graphic design and composition through projects such as layout design, advertising design, poster design, and product design. Emphasis will be on the design and composition aspect of printed material graphics. Students will learn both the Adobe InDesign program and the Adobe Photoshop program; prior knowledge of the program is not necessary. Prerequisites: G10 or above. Note: This course is also available for FPA credit (see course 714).",
	"818": "The focus of this course is to build hands-on video and editing skills. Students will engage in a variety of activities learning basic production processes and create their own productions. This is a basic introduction to the language of media. Students examine familiar fictional texts, analyzing stars and stereotypes from easily accessible forms such as TV or film. The skills learned in this course will give students the production skills needed to help them in more context focused courses of media study. Prerequisites: None. Note: This course is also available for FPA credit (see course 790).\n",
	"819": "The focus for this course is community service based filming and hands-on production work. Students develop a hands-on approach of camera usage, filming techniques, production skills and editing in a variety of video forms and animation. Students will participate in school events to film and edit content for broadcast to the school community. They develop skill and technical competence in practical hands on activities working up to produce their own ‘multimedia’ video work. Prerequisites: Introduction to Media Production or permission from instructor. Note: This course is also available for FPA credit (see course 795).",
	"820": "The focus for this course explores the concepts of representation and stereotypes through advertising and non-fiction media. Students view, listen to, and analyze relevant mainstream and commercial media texts as their experience of the language of media is reinforced. They examine how audiences’ are influenced and targeted through marketing tactics and generate their own responses to these texts. Student will also engage in a variety of activities learning basic production processes, software such as Final Cut Pro and Adobe Photoshop, equipment handling & usage to create their own Advertising campaign & TV production. Prerequisites: Introduction to Media Production or permission from instructor. Note: This course is also available for FPA credit (see course 798)",
	"7001": "This is an advanced non-performance music course dedicated to the academic study of music. The primary emphasis is on theoretical analysis of music (analyzing melody, harmony, texture, form, etc.). Secondary emphases include composition, history, listening, and aural skills. This course will foster independent, creative, and analytical thinking about music. No concerts or performances will be required for this course, though students will learn to sight-sing in class. This course should be of particular interest to any student considering music study at the university level, as well as anyone interested to deepen your understanding of music or write your own music. This course will not meet during P block, and will have no effect on your ability to participate in any music ensemble or take a study hall. Prerequisite: None. Previous experience in a music ensemble or lessons is recommended, but not required.",
	"7002": "In this course students with no prior experience will learn to play on and sing with guitar. No previous musical experience or knowledge is required, though students with experience are certainly welcome. No public concerts or performances will be required, though you will need to play and sing every day in class. If you enjoy music and want to learn more about it, but maybe do not enjoy rehearsals and concerts in a school band, choir, or orchestra, this is the class for you. Students who already have an advanced knowledge of guitar are not recommended to take this course. The course is geared toward those with no prior experience on guitar. Students will learn different styles of playing chord accompaniments and melodies, as well as simple improvisation and composition. This course will not meet during P block, and will have no effect on your ability to participate in any music ensemble or take a study hall. Prerequisite: None. Note: Students will need to supply their own guitar.",
	"7004": "Through hands on exploration, students will learn to create, perform, appreciate and understand music in our world. Students in this class will be listening to music, composing and arranging music using drums and unconventional instruments, creating their own music videos, and analyzing and writing about music, dancing, and singing. Prerequisite: None.",
	"7005": "Class piano is designed to teach the basic concepts and fundamentals of piano performance. Students will play melodies/harmonies in several keys and have the opportunity to participate in ensembles within the class. Students will develop good practice habits, and learn techniques to increase the agility and flexibility of their hands. Students will learn the vocabulary of chords and keys. Prerequisite: None.",
	"7006": "Guitar 2 is an intermediate level guitar course. It is designed for those with beginning-to-intermediate level guitar skills. It will offer the opportunity for students to develop and extend their knowledge and understanding of music using guitar as the medium. This course provides the structures and opportunities for students to learn skills, theory, history, performance, and creation of music. Prerequisite: Guitar 1 or Teacher recommendation. Note: Students will need to supply their own guitar.",
	"7007": "This is an advanced music course dedicated to the academic study of music. It corresponds to two semesters of a typical introductory college music theory course that covers topics such as musicianship, theory, musical materials, and procedures. The course is about the theoretical analysis of music (analyzing melody, harmony, texture, form, etc.) and applying that to composition, listening, and aural skills. Musicianship skills (including dictation and other listening skills), sight-singing, and keyboard harmony are considered an important part of the course. This course will foster independent, creative, and analytical thinking about music. Students will develop the ability to recognize, understand, and describe basic materials and processes of music that are heard or presented in a musical score. Development of aural skills is a primary objective. Performance is part of the learning process, but no concerts or performances will be required for this course. Students will learn to understand basic concepts and terminology by listening to and performing a wide variety of music. Notational skills, speed, and fluency with basic materials are emphasized. This course should be of particular interest to any student considering music study at the university level, as well as anyone interested in deepening their understanding of music or composing their own music. Prerequisite: G9; Completion of Music Theory OR teacher recommendation (possibly based on completion of ABRSM Music Theory Level 5). Co-requisite: Concurrent enrollment in an ICS music performance ensemble (band, choir, or orchestra).",
	"7008": "What is music? Who is a musician? What do good musicians do? These underlying questions will be challenged and explored in this entry-level course focused on the impact of digital technology on music. Digital Music is an engaging, hands-on course that blends the learning of music with modern technology tools. The world is changing at a fast pace, impacting everything in the process, including music. The course will explore how the discipline of music has been affected and can be learned in both traditional and nontraditional ways through electronic and digital technology. Students will encounter, discover, and create music through such mediums as software programs, the internet, USB keyboards and wireless devices, hard technology, and musical instruments. This course will both challenge and embrace tradition as it promotes reflection on the underlying questions stated above. Students will be evaluated based on their 1) knowledge and understanding, 2) application skills and development, 3) focused engagement, and 4) reflection and evaluation. The use of a creative/design cycle process (i.e. plan, design, create, and evaluate) may also be used and incorporated into the learning process. Prerequisite: None.",
	"7131": "Instead of focusing on one or two media, this course will include a wider variety of materials that are not investigated in the drawing/painting classes. It will take more of an inquiry-based approach to the curriculum (in other words, students will have some ownership in choosing and planning projects). Contemporary Media and Design is not as intensive as the drawing/painting classes in terms of building technical skills, instead encouraging the creative process by exploring different media and techniques found in contemporary art. This course is recommended for students with an interest in art, whether or not they desire to pursue art further. Prerequisites: None.",
	"7372": "This small ensemble is for beginning level choral performers. The curriculum includes instruction in proper singing habits such as correct posture, breathing and tone production, singing in a world language, and basic music theory. Performances will occur monthly to a variety of audiences. Prerequisites: None.",
	"7512": "This semester class will teach the principals behind acting for the camera, which is completely different from stage acting. The students will work with each other and students from technology classes in order to make video productions, short films, and action sequences. Some minor study of famous film actors is an essential part of this class, though most of the learning will be from hands-on experience and the feedback and critique of peers.\nIt is indisputable that actors need to be able to have acting skills for the screen. This makes the actor more marketable and provides experience with behind-the-scenes work as well. Students also learn how acting for the camera can be used to serve their community in Hong Kong and elsewhere.",
	"7513": "This semester-long class will explore the various aspects of a standard theater production on a main stage (proscenium). Students will be able to participate in all of the roles involved in a production. These roles include (but are not limited to) working as a director, actor, light tech, set designer, costume designer, and make-up designer. Students also learn how drama can communicate morality and faith and serve the community through outreach. Each student makes an audition portfolio, which is necessary at the university level and beyond.",
	"7514": "This semester-long class puts on productions that are not standard. This includes improv drama, one-act plays, children’s theater, thrust staging, theater in the round, and others.\nStudents will be able to participate in all of the roles involved in a production. These roles include (but are not limited to) working as a director, actor, light tech, set designer, costume designer, and make-up designer. Students also learn how drama can communicate morality and faith and serve the community through outreach. Each student makes an audition portfolio, which is necessary at the university level and beyond.",
	"7515": "This semester-long class will explore the various aspects of a standard theater production on a main stage (proscenium). Students will be able to participate in all of the roles involved in a production. These roles include (but are not limited to) working as a director, actor, light tech, set designer, costume designer, and make-up designer. Students also learn how drama can communicate morality and faith and serve the community through outreach. Each student makes an audition portfolio, which is necessary at the university level and beyond.",
	"7516": "This semester-long class puts on productions that are not standard. This includes improv drama, one-act plays, children’s theater, thrust staging, theater in the round, and others.\nStudents will be able to participate in all of the roles involved in a production. These roles include (but are not limited to) working as a director, actor, light tech, set designer, costume designer, and make-up designer. Students also learn how drama can communicate morality and faith and serve the community through outreach. Each student makes an audition portfolio, which is necessary at the university level and beyond.",
	"7621": "This course introduces students to the technical skills used in the performing arts, including sound, lighting, staging, stage-management, rigging, video, and multimedia. While working with these technologies, students will study the relevant underlying principles in applied science, engineering, and Physics. The class format will be an interactive seminar style. Students will be required to attend certain performances during the year as part of our class evaluation of the technology used in the performances. Hands-on learning will take place at events and programs, on and off campus, where students will have the opportunity to practice their skills. Students are expected to have a reasonable level of fitness and dedication due to the oftentimes long hours and physically demanding support needed at such events. Prerequisites: Fall Semester: None; Spring Semester: Previous theater technology experience.",
	"7662": "If the subscription to ICS Voices is too large, those students will be divided into two gender-based choirs, and will be called the ICS Men’s Choir and the ICS Ladies’ Choir. This large ensemble is for intermediate level choral performers. The curriculum includes instruction in proper singing habits such as correct posture, breathing and tone production, singing in a world language, and basic music theory. Performances include the Christmas and Spring Concerts, as well as community events. Prerequisites: Audition and teacher permission.",
	"7831": "This course is designed for the ceramics student who is interested in developing a body of work for exhibition, presentation, or for an AP 3D-Art portfolio. Students will work with the teacher mentor to plan their area of study. Students will have greater opportunity to use different hand building and throwing techniques to express their own creativity and critical thinking skills in building their forms. Included are discussions of how surface embellishment and firing processes affect both the function and aesthetics of the ceramic object. Prerequisites: Ceramics 1 and Ceramics 2.",
	"7962": "This class is open to all students in grades 9 – 12 who play violin, viola, cello, or double bass. This performance and skill-based class will include playing a varied repertoire of music with emphasis on advancing skill technique. This group performs during the Christmas and Spring instrumental concerts, and may have other performing opportunities in the community. Prerequisites: Students should have at least two years of experience with their string instrument. If students have one year of experience with their string instrument, teacher recommendation is needed.",
	"7971": "This course explores propaganda and persuasive language through non-fiction media (TV News and popular Documentary). Students further their understanding of non-fiction media forms and genre and explore ways media can be used to persuade and manipulate through various technologies and techniques. Students view, listen to, and analyze a range of journalistic or documentary forms, and undertake more extensive research into the representation and reporting of cultural groups and issues. They will draw on this knowledge when developing ideas for their own productions. They will build on Photoshop and film production skills to explore the idea of a manipulated image, produce a segment of news via a newsroom simulation, and produce a documentary to express their ideas and explore an issue of their choice. Prerequisites: Students need to either have completed Popular Culture in Media, Film Studies or Film Art, or be grade 11 or 12.",
	"7972": "The focus of this course is community service-based filming and hands-on production work. Students will use a hands-on approach in the use of a camera, filming techniques, production and editing in a variety of video forms and animation. They will film school events and edit content for broadcast to the school community. They develop skill and technical competence in practical hands-on activities working towards producing their own ‘multimedia’ video work. Prerequisites: Introduction to Media Production or permission from instructor. Note: This course is also available for computer credit (see course 819).\n",
	"006": "This is a seminar course in which students will study a variety of novels from different countries, familiarize themselves with their social, historical and cultural backgrounds, and examine themes and characters in the light of the ethos of those countries. Interspersed with the study of novels, students will experiment with a variety of creative and personal writing, following the various steps of the writing process. Prerequisite: Literature Survey or Composition; G11 or above.",
	"308": "The AP US History gives juniors and seniors an opportunity for university credit. The course, spanning 1490 to 1990, has an in-depth and rigorous agenda. Students will consider various aspects of the American political, economic, social, cultural, intellectual, and diplomatic historical experience. Due to low numbers, this course will probably only be offered every second year. If this is a course you require, it is strongly suggested that you show your intention by signing up during preliminary course sign-up. If you leave it to grade 12, it may not be available. Prerequisites: Modern European History and Asian Studies; G10 with a 95% grade in Modern European History, G11 or above. American Literature Honors is also recommended (taken previously or concurrently).",
	"580AIC": "This document applies to students who are participating in sports at a high level outside of ICS. They may be approved for ICS P.E. credit by signing up for AISC. This credit counts toward the two required credits of P.E. at ICS; G11 or above.",
	"580BB\, 580T\, and 580BH": "Students can earn PE credit for their participation on a competitive ICS sports team. (Participation on teams or clubs outside of ICS cannot be used for credit for this course.) In this course students will receive instruction from coaches on sports mechanics, strategies and tactics, related rules, and apply these in practice and game situations with their respective teams. This course is offered after school and is a percentage-graded course. To fulfill the requirements for this course a student must accumulate a minimum of 50 sports team hours, attend course meetings, and complete the written assignments (log book, self-assessment, and reflection journal). The deadline for students dropping the course will be five school days following the end of the designated tryout period for the Season #2. Consult the course teacher for additional information. Prerequisites: This is open only to G11 and G12 students who play on an ICS competitive sports team. Note: This course is only offered during Semester 2.",
	"580VB\, 580SW and 580XC": "Students can earn PE credit for their participation on a competitive ICS sports team. (Participation on teams or clubs outside of ICS cannot be used for credit for this course.) In this course students will receive instruction from coaches on sports mechanics, strategies and tactics, related rules, and apply these in practice and game situations with their respective teams. This course is offered after school and is a percentage-graded course. To fulfill the requirements for this course a student must accumulate a minimum of 50 sports team hours, attend course meetings, and complete the written assignments (log book, self-assessment, and reflection journal). The deadline for students dropping the course will be five school days following the end of the designated tryout period for the Season #1. Consult the course teacher for additional information. Prerequisites: This is open only to G11 and G12 students who play on an ICS competitive sports team. Note: This course is only offered during Semester 1.",
	"811D  ": "This year-long course is designed for students who have no prior background or knowledge in programming, and it creates a strong foundation for the AP Computer Science course which follows. Topics covered include computer history, computer logic, computational thinking, programming strategies, algorithms, code development, pseudo-code, flowcharts, and logic gates. The Java language is used as the basic coding compiler, providing the context of all object-oriented programming instructions. Students will interact with other students who are participating in the online course. The Introduction to Computer Programming course is offered through ICS’ Online Learning section and will be facilitated by an ICS teacher. In the event that ICS is unable to staff this course, students can take an equivalent course through an online provider. Note: This course is strongly recommended as a prerequisite for the AP Computer Programming Course. Prerequisite for this course: Pre-Algebra.",
	"850D": "This course follows the AP Computer Science syllabus. Students will look more closely at the design and operation of computers, computer systems and coding in JAVA, building on the fundamental concept of object-oriented programming. The external AP Computer Science examination is based on JAVA programming. AP Computer Science is offered via SevenStar Academy, our distance learning partner. ( http://www.sevenstaracademy.org/) For qualified and pre-approved students (up to a cap), ICS will reimburse students 100% of the pre-approved course fees paid to the pre-approved course provider, after the student passes the course within the school year of study. Once completed, an accurate receipt verifying the cost needs to be submitted for reimbursement. Prerequisite: Intro to Computer Programming or Teacher Recommendation."
}
